; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_7_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 - counter
	)
  (:init
		(= (value c0) 22)
	(= (value c1) 58)
	(= (value c2) 4)
	(= (value c3) 20)
	(= (value c4) 89)
	(= (value c5) 6)
	(= (value c6) 0)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
		)
	)
)

; plan
1. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 3 of 6
2. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 3 of 6
3. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 3 of 6
4. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 3 of 6
5. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 3 of 6
6. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 3 of 6
7. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 3 of 6
8. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 3 of 6
9. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 3 of 6
10. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 3 of 6
11. (increment c6)
   changed: (value c6) from 0 to 4
   goals met: 3 of 6
12. (increment c6)
   changed: (value c6) from 4 to 8
   goals met: 4 of 6
13. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 4 of 6
14. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 4 of 6
15. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 4 of 6
16. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 4 of 6
17. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 4 of 6
18. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 4 of 6
19. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 4 of 6
20. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 4 of 6
21. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 4 of 6
22. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 4 of 6
23. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 4 of 6
24. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 4 of 6
25. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 4 of 6
26. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 4 of 6
27. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 4 of 6
28. (increment c2)
   changed: (value c2) from 4 to 12
   goals met: 4 of 6
29. (increment c2)
   changed: (value c2) from 12 to 20
   goals met: 3 of 6
30. (increment c2)
   changed: (value c2) from 20 to 28
   goals met: 3 of 6
31. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 3 of 6
32. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 3 of 6
33. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 3 of 6
34. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 3 of 6
35. (increment c2)
   changed: (value c2) from 28 to 37
   goals met: 3 of 6
36. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 3 of 6
37. (increment c2)
   changed: (value c2) from 37 to 47
   goals met: 3 of 6
38. (decrement_rate c3)
   changed: (rate_value c3) from 1 to 0
   goals met: 3 of 6
39. (decrement c2)
   changed: (value c2) from 47 to 37
   goals met: 3 of 6
40. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 3 of 6
41. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 3 of 6
42. (increment c5)
   changed: (value c5) from 6 to 16
   goals met: 2 of 6
43. (decrement c4)
   changed: (value c4) from 89 to 84
   goals met: 2 of 6
44. (increment c5)
   changed: (value c5) from 16 to 26
   goals met: 2 of 6
45. (increment c5)
   changed: (value c5) from 26 to 36
   goals met: 2 of 6
46. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 2 of 6
47. (increment c6)
   changed: (value c6) from 8 to 13
   goals met: 2 of 6
48. (increment c6)
   changed: (value c6) from 13 to 18
   goals met: 2 of 6
49. (increment c6)
   changed: (value c6) from 18 to 23
   goals met: 2 of 6
50. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 2 of 6
51. (increment c5)
   changed: (value c5) from 36 to 46
   goals met: 2 of 6
52. (decrement c4)
   changed: (value c4) from 84 to 78
   goals met: 2 of 6
53. (increment c6)
   changed: (value c6) from 23 to 28
   goals met: 2 of 6
54. (increment c6)
   changed: (value c6) from 28 to 33
   goals met: 2 of 6
55. (increment c6)
   changed: (value c6) from 33 to 38
   goals met: 2 of 6
56. (increment c6)
   changed: (value c6) from 38 to 43
   goals met: 2 of 6
57. (increment c6)
   changed: (value c6) from 43 to 48
   goals met: 3 of 6
58. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 3 of 6
59. (increment c5)
   changed: (value c5) from 46 to 56
   goals met: 2 of 6
60. (decrement c4)
   changed: (value c4) from 78 to 71
   goals met: 2 of 6
61. (increment c6)
   changed: (value c6) from 48 to 53
   goals met: 2 of 6
62. (increment c6)
   changed: (value c6) from 53 to 58
   goals met: 3 of 6
63. (decrement c4)
   changed: (value c4) from 71 to 64
   goals met: 3 of 6
64. (decrement c4)
   changed: (value c4) from 64 to 57
   goals met: 3 of 6
65. (decrement c4)
   changed: (value c4) from 57 to 50
   goals met: 4 of 6
66. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 6
67. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 6
68. (decrement c2)
   changed: (value c2) from 37 to 27
   goals met: 4 of 6
69. (decrement c1)
   changed: (value c1) from 58 to 54
   goals met: 4 of 6
70. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 4 of 6
71. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 4 of 6
72. (decrement c2)
   changed: (value c2) from 27 to 17
   goals met: 5 of 6
73. (decrement c1)
   changed: (value c1) from 54 to 48
   goals met: 5 of 6
74. (increment c2)
   changed: (value c2) from 17 to 27
   goals met: 4 of 6
75. (decrement c1)
   changed: (value c1) from 48 to 42
   goals met: 4 of 6
76. (decrement c2)
   changed: (value c2) from 27 to 17
   goals met: 5 of 6
77. (decrement c1)
   changed: (value c1) from 42 to 36
   goals met: 5 of 6
78. (decrement c1)
   changed: (value c1) from 36 to 30
   goals met: 5 of 6
79. (increment c2)
   changed: (value c2) from 17 to 27
   goals met: 4 of 6
80. (decrement c1)
   changed: (value c1) from 30 to 24
   goals met: 5 of 6
81. (decrement c2)
   changed: (value c2) from 27 to 17
   goals met: 5 of 6
82. (decrement c1)
   changed: (value c1) from 24 to 18
   goals met: 4 of 6
83. (decrement c1)
   changed: (value c1) from 18 to 12
   goals met: 5 of 6
84. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 5 of 6
85. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 5 of 6
86. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 5 of 6
87. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 5 of 6
88. (decrement c0)
   changed: (value c0) from 22 to 18
   goals met: 5 of 6
89. (decrement c0)
   changed: (value c0) from 18 to 14
   goals met: 5 of 6
90. (decrement c0)
   changed: (value c0) from 14 to 10
   goals met: 6 of 6
